[{
	"review": "Pero deberia de poder cambiarle el idioma a alexa",
	"author": "WarcryxD",
	"review_source": "iTunes",
	"rating": 4,
	"title": "Excelente",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-01-12T02:27:03.000Z"
}, {
	"review": "Cannot fix connection glitches without this-also fix connection glitches \n\nSmart things sees my light and Alexa doesn’t :(\n\n*update new devices “unresponsive” each day...they are working fine in SmartThings. No way to delete disabled devices. Very poor.",
	"author": "Ranchorat",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Need to be able to delete devices",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-06T13:06:33.000Z"
}, {
	"review": "After typing in the log in screen and submit, jump back to the login screen.",
	"author": "omgzero",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Can’t log it",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-06T14:48:03.000Z"
}, {
	"review": "I’m new to Alexa and so far I’m pretty impressed.   One thing I am surprised is missing is the ability to play music as part of a routine.  I want to be able to turn on my lights and start some music when I come downstairs each morning with a single command.",
	"author": "ImNorm29",
	"review_source": "iTunes",
	"rating": 3,
	"title": "New user",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-06T16:30:00.000Z"
}, {
	"review": "There’s no way for me to link iHeart Radio to Alexa. My account was setup via Facebook login \u0026 the app doesn’t give that as an option. Frustrating.",
	"author": "kmryan12",
	"review_source": "iTunes",
	"rating": 1,
	"title": "No login with FB option...",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-07T00:31:00.000Z"
}, {
	"review": "I would think a huge company would invest as much in the software app as their awesome product. This app does NOTHING that it *could* do with the echo. But I guess when you have foreigners who don't speak English well, in charge of doing the software project, it shows.  \n\nWhy can't it create a simple reminder every day?  Why can't it tell you when someone adds a new item to a list?  My list of shortfalls goes on and on. \n\nIt's Irritating that there are such CRAPPY skills available AND when you go to look at one, you must go back to PAGE 1 and start over through the list. Really?  (Apparently amazon listened and fixed this in 2017 after two years)\n\nCan't believe all the utterly useless apps here and NO WAY to FILTER them. I.e. Why can't I nuke all the crappy apps about INDIA?   Being an American, I should never see India-themed apps if I don't care about anything Indian. \n\nVery poor software from Amazon",
	"author": "bmfb1980",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Needs major work.  Made by teenagers?",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-07T04:13:12.000Z"
}, {
	"review": "I loved this app but I finally updated after two years and, like the title states, is horrible!",
	"author": "RoguesNtheHouse",
	"review_source": "iTunes",
	"rating": 1,
	"title": "New update is horrible",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-07T05:16:21.000Z"
}, {
	"review": "It’s really frustrating when I can’t even set up my new Alexa because the app will not let me “allow” permissions. It just freezes on a white screen.",
	"author": "MissCarlyRose",
	"review_source": "iTunes",
	"rating": 1,
	"title": "New update won’t even open or allow me to set up",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-07T06:06:07.000Z"
}, {
	"review": "It seems as though features disappear. The routines I was able to program a scene from the smart home. Now a can NO LONGER run a scene. The update says a I can remove a device from the smart home yet I can’t remove it only disable it.",
	"author": "kjm1968",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Features disappearing",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-07T06:17:50.000Z"
}, {
	"review": "Too many bugs. Just doesn’t work",
	"author": "markbruce44",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Terrible",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-07T20:16:51.000Z"
}, {
	"review": "After about a 2 month hiatus I can’t connect Bc the app is so buggy!!!! \nFix this issue Jeff!!",
	"author": "Tonjarellie",
	"review_source": "iTunes",
	"rating": 1,
	"title": "What happened?",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-08T00:00:09.000Z"
}, {
	"review": "Add Russia and Russian language Alexa best assistant, many people in Russia waiting look forward to when you add our country. Many people want to use the native language.",
	"author": "Alex add Russia",
	"review_source": "iTunes",
	"rating": 5,
	"title": "Add Russia and Russian language",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-08T00:15:43.000Z"
}, {
	"review": "Does Jeff not actually use this app him self? Because there is no way I would let this app roll into qa in its current form, let alone give it to uncle B,\n\nThe google home app is sitting on 4.4 stars, just saying",
	"author": "lowccr",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Hey jeff@ why are you doing this?",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-08T11:51:59.000Z"
}, {
	"review": "Slow and laggy.  This app will make you think you didn't accurately touch some button, then you'll touch it again and it will buffer that and then send you somewhere else beyond that you may have wanted.\n\nAnother shortcoming is that the alarm in which Amazon setup alexa to not be able to play music (Amazon's, Pandora, Spotify).  This \"smart\" internet attached thing can't match the capability of a basic alarm clock which can play  music (via local airwave broadcast). Ponder that.",
	"author": "Screbob",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Slow, laggy, feature limited.",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-08T20:44:55.000Z"
}, {
	"review": "Screen freezes when asking for permissions",
	"author": "Qugeqbfetddhy",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Does not work on iPhone X",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-08T21:18:21.000Z"
}, {
	"review": "I’m trying to set up Alexa to recognize my voice so I can hear my calendar and when I am trying to set up device language, it keeps crashing and closing app. Argh!! Wasted about an hour now.",
	"author": "Swimchic3",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Setup voice and it keeps crashing",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-09T00:01:12.000Z"
}, {
	"review": "It’s garbage, and I frequently need to use it. Never works as expected, always a real chore to get the device to the level you want without invoking voice api",
	"author": "zmf3",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Volume slide on player app",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-09T00:18:11.000Z"
}, {
	"review": "This app is miserable. Not friendly user at all. I struggle to use this and do not recommend this app to anyone",
	"author": "Rguo12",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Terrible App",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-09T15:16:05.000Z"
}, {
	"review": "Thanks to the most recent app update, my phone and my Amazon device are no longer paired and I can't get them to work together again. You've just made my Amazon device almost completely unusable.",
	"author": "Heather Ilene",
	"review_source": "iTunes",
	"rating": 1,
	"title": "After Latest Update My Device No Longer Connects",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-09T22:29:32.000Z"
}, {
	"review": "I added Koogeek smart plugs to Alexa. I was able to control 3 devices via Alexa, which was really good. But after some weeks the connection was lost. I tried to disable and re-enable with no success. I finally decided to reset the koogeek device. I decided that the best approach would be to delete the smart device from the Alexa app and re-discover the device.  I was horrified to discover that there is NO way to delete a device from the app. \n\nI contacted amazon help and I got a instructions to use a trash icon which does not show on either my iPod or iPad. \n\nI can see why this app is rated 2.4.",
	"author": "Nogales Family",
	"review_source": "iTunes",
	"rating": 1,
	"title": "The smart home section is very poor",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T01:47:21.000Z"
}, {
	"review": "Update 12/9...Once again Amazon fails with a bad app release!!!! \n\nWhy can’t you guys fix this! Honestly it can’t be that dang hard!!! For all things you get right and something this simple you can’t is amazing!!! \n\nNow skips forward more than 30 seconds when reading my kindle books then locks up and won’t read them at all!!!!",
	"author": "Pink1966",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Update 12/9 Epic Release Fail",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T02:20:46.000Z"
}, {
	"review": "Just because you offer a new option, why must you keep trying to FORCE us to use it?  I want to use the shopping list option, but you keep trying to to make me use my contact list for messaging.  I do NOT need to continue to log in when I just want to have my shopping list available when I get to the store!!!  I have uninstalled and reinstalled a number of times but it is unusable.  Thanks for screwing us a good app.  😖",
	"author": "Whannabe",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Latest version is Useless!",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T02:36:53.000Z"
}, {
	"review": "Hard to use and skills can never be disable",
	"author": "xKiDzZ",
	"review_source": "iTunes",
	"rating": 1,
	"title": "This app is a complete disaster",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T05:04:19.000Z"
}, {
	"review": "tried around one hour and still get dead recursive call！！！",
	"author": "sssssstan",
	"review_source": "iTunes",
	"rating": 1,
	"title": "totally cannot login！！！",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T09:11:00.000Z"
}, {
	"review": "This app is very buggy!! I am so very tired of reading “oops something went wrong...”",
	"author": "\"Sunshine09\"",
	"review_source": "iTunes",
	"rating": 2,
	"title": "Not good",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T13:49:14.000Z"
}, {
	"review": "I have had no problems with this app. I do have high speed internet.  Everything works as stated. Updates have been clean and without problems.  I have forced updates though to the latest version on devices and this is important as their have been some major updates. Only once recently my amazon music did not show up in the app but that was only for a day.  Can not makes calls with my ipad wifi only but have no problems with my android phone.  Would be nice if they could get calls to work on any wifi enabled device (not just cell side).  The different ways of calling eg drop in, call to a contacts mobile, call to devices could-this interface could be made a little more intuitive but I have had no problems calling; indeed have had no problems functionally with this app or the devices working with the app.",
	"author": "ddmacpp",
	"review_source": "iTunes",
	"rating": 4,
	"title": "Alexa app works well for me",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T17:51:10.000Z"
}, {
	"review": "Smart home screen does not work ever! Very bad experience. I'm waiting Google home to arrive after 2 days!",
	"author": "أبوسما",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Useless",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T18:04:12.000Z"
}, {
	"review": "Amazon wants you to get used to asking alexa for everything, but while she can answer questions she can't DO simple things like simply search for bluetooth devices, tell you what she finds and you tell her the one to pair to. Nope. Anything remotely technical requires you to use this app. And this app is painful to use. It starts off tyrying to push echo dot conversations on me. It's got 3 buttons that all seem to do the same thing (start conversations with people over echos). If you tell alexa to conncet to bluetooth she tells you to use this app (why? Its the 21st century! Why cant you just find and pair without me having to manually do it in an app), but she then says to install the skill in smart home. Smart home, list devices.. Cant find bluetooth speakers. Ok, skills, i guess i have to install a stupid skill for bluetooth. The skills section of the app is a hot mess. The search funtion flatout DOES NOT WORK. On top of that, apparently we're still in the dark ages of smart devices because every vendor under the sun has their own stupid skills app they want you to install on alexa. This s reams of no standadizations yet. Alexa shouldnt need to learn \"skills\" to connect to smart devices. She has to simply because smart device manufacturers havent standardized things yet. Everyone of them wants to be primma donna with their own skill app, so in addition to painfully digging for it, you have to pray the vendor actually put time into making it work (theres a reason they have star ratings on the skills...ugh). Anyways, i have to google up how to pair alexa to bluetooth speakers (that very necessity means alexa is failing at her GD job, bc she tells me to go to this stupid app instead of doing it directly, and this app is a hot mess to use). There is a bluetooth section. But the app can only seem to find ONE device at a time. Your device didnt show up? Hit back and try again, like you're at a roullette table hoping your number comes up. Ugh! Finally my speakers show up, and the app sits there trying to connect. My phone takes like 2 seconds to connect to them when I do it through settings. But alexa (echo dot) takes forever. Why?! Then you exit, try again, but she lists them as a decice she knows BUT IS NOT PAIRED TO. PAIR TO THE GD SPEAKERS FFS! You click on them in the list, app cooks then finally pairs. Does alexa say anything to automatcally confirm she's using the speakers? No. So you have to ask her something stupid to get her to speak and see if shes using the speakers. This way more painful then it should be. You can make a list using her, but to delete it \"use the app\". Why? DELETE THE GD LIST WHEN I TELL YOU! And lists are useless. I make a list of songs. Tell alexa to play the songs in the list. Nope. She can't do that. I make a list of numbers. Give me the sum total of those numbers. Nope. They need to add WAY more functionality to lists if they're going to be of any use. They're basically one dimensional string arrays you cant do anything with. So close yet so far. Next we have the tplink smart plug amazon suggested we buy when we got the echo dot. Well we have a living room lamp thats a pita to turn on and off so it'd be great to just tell alexa to do that. Try to get that thing going is a pita in and of itself (plug in, install ANOTHER app, hook to it, hook to network, create yet another login, etc). Finally get it going as a smart plug. Now we have to pair it with alexa. Open skills, install more crap, look for device IN THE APP bc alexa is too stupid to pair using just voice, finally get them paired. \"Alexa turn on the (light name)\". \"I'm sorry I can't find that device.\" YES YOU CAN! I'M LOOKING AT IT RIGHT IN YOUR APP! I CAN EVEN USE YOUR APP TO MANUALLY TURN IT ON AND OFF! WHY CAN'T YOU VOICE COMMAND IT?! This was one of the reasons we got the echo dor and it CAN'T DO IT'S GD JOB! They need to make alexa be able to do more of this maintenance crap through her instead of this stupid app. They need to standardize smart devices and get rid of skills. But if they force you to install skills, FIX THE GD SEARCH. This app is painful and makes me want to get rid of alexa.",
	"author": "PreliminaryHerring",
	"review_source": "iTunes",
	"rating": 2,
	"title": "Painful",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T18:41:21.000Z"
}, {
	"review": "Not possible to get past the page where it asks for permissions (none of the buttons except “Learn more” work).",
	"author": "jgirard",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Broken on iPhone X",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T19:43:10.000Z"
}, {
	"review": "This app is unusable, it launches and then doesn’t finish loading...hangs. Amazingly surprising for Amazon.",
	"author": "Taylor810ce",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Unusable",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-10T22:43:14.000Z"
}, {
	"review": "Can not enable smart skills, there is a bug. When tapping enable, I receive a blank screen only. I cannot link my tp-link smart plug",
	"author": "Desk is",
	"review_source": "iTunes",
	"rating": 2,
	"title": "Home smart skills not working",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-11T06:39:23.000Z"
}, {
	"review": "The player function does not work. \n\nHello Amazon, how can your QC on your flagship new product be so bad?",
	"author": "Matt N4 at Drexel U",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Don't update to NOV 29 Version",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-11T10:41:35.000Z"
}, {
	"review": "What a worthless junk app!! First time I come up with such a failed app. \nI have to return the echo just because the app wouldn’t work since you can’t setup the device without the app. \nShame on you amazon !!!!!!!",
	"author": "Tolgaakr",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Worthless!! It doesn’t work",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-11T21:51:23.000Z"
}, {
	"review": "1. Slow. Takes forever to navigate to the shopping list if your connection is less than perfect. \n2. Crappy refresh routines make the shopping list feature unusable in a grocery store. \n3. Cards sometimes show what you ask - but not always. \n4. Useless ‘drop in’ gets a button on the main screen, but the useful ‘shopping list’ takes three steps to get to. \n5. You can’t talk to this app as Alexa - for that you have to use the Amazon shopping app!",
	"author": "Horace Gumboot",
	"review_source": "iTunes",
	"rating": 2,
	"title": "Alexa is good, this app is terrible.",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-12T03:26:39.000Z"
}, {
	"review": "Cannot login. Having my echo dot as a bullsh*t",
	"author": "Zero_mitsu",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Most stupid app I've ever used",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-12T04:07:51.000Z"
}, {
	"review": "I don’t have any main problems with app but the fact that I can’t add individual skills to a routine instead of playing my whole flask briefing is ridiculous. They really need to get on that. If that can happen then I’ll give the app a perfect 5.",
	"author": "ninirobi",
	"review_source": "iTunes",
	"rating": 4,
	"title": "It’s good but...",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-12T17:32:21.000Z"
}, {
	"review": "No search option for music. This app will leave you playing songs over Bluetooth instead of controlling Alexa through the app. The developer should be fired.",
	"author": "Craigyas",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Near Useless App.",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-12T19:15:12.000Z"
}, {
	"review": "This app needs a lot of work. The glitches make it almost unusable! There is a screen that asks for permission to see contacts for the call/text feature, but that screen continues to pop up even after I’ve allowed them. It is not the full permission screen and has errors when you press Allow or not. The only fix I’ve found is to delete the app and reinstall it. What a waste of time! There are other glitches almost every time I use the app as well. Disappointing!",
	"author": "JenDrees6",
	"review_source": "iTunes",
	"rating": 1,
	"title": "Amazon can do better",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-12T19:29:36.000Z"
}, {
	"review": "Setting an alarm can be difficult because you have to tell Alexa and be very clear with the instructions. This takes A LOT of time. It would be better if we could set an alarm through the app. It doesn’t make sense why you can set reminders through the app, but not alarms and timers. It’s very time consuming and confusing. Please fix it.",
	"author": "zcmin68",
	"review_source": "iTunes",
	"rating": 2,
	"title": "Alarms",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2017-12-13T03:32:02.000Z"
},
{
	"review": "Great developer!!!",
	"author": "",
	"review_source": "GooglePlayStore",
	"rating": 5,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Had a lot of difficulty hooking device up to WiFi",
	"author": "Sean Flynn",
	"review_source": "GooglePlayStore",
	"rating": 4,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Unable to delete devices from the app so I have about 5 duplicate hue bulbs in this thing. Voice commands are stupid at best.  I have bedroom fan light as a group and only that. If I'm waking up in the morning and say bedroom fan lights the system is too stupid to know that there is no device called lightS and to just go with light. This is the difference between AI and simply a trigger word which is what Amazon uses. There's no intelligence behind the system.",
	"author": "Kellic AnonymousTiger",
	"review_source": "GooglePlayStore",
	"rating": 2,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Why is there no widget to use the Alexa command???  Other than that, it works great for adding skills, setting up smart home devices. Get that widget for my home screen!",
	"author": "Jason Kloos",
	"review_source": "GooglePlayStore",
	"rating": 4,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Useless app. time waste. I have Los money and time",
	"author": "mohamed ali mohamed",
	"review_source": "GooglePlayStore",
	"rating": 1,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Very slow three blue dots most of the time. Very hard to remotely control an echo using this rubbish software.",
	"author": "Roger Leitch",
	"review_source": "GooglePlayStore",
	"rating": 1,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Amazing app and works perfectly, can't understand what all the bad reviews are about.",
	"author": "Charlie R",
	"review_source": "GooglePlayStore",
	"rating": 5,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "This came on my LG G6 Plus android Prime phone I can't even sign in it tends to lock the the phone up your mileage may vary",
	"author": "",
	"review_source": "GooglePlayStore",
	"rating": 1,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Need to be able to control fire stick like USA. App is over complicated",
	"author": "Keith Semple",
	"review_source": "GooglePlayStore",
	"rating": 2,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "When Alexa doesn't hear me correctly and I want to help give Amazon feedback to improve her, I can never find the card to do that.  The music feature doesn't allow you to search for your artist, you have to scroll and scroll and scroll till you find them. That is really sad that you can't simply type in what you are looking for and bam!",
	"author": "Josh Lyczkowski",
	"review_source": "GooglePlayStore",
	"rating": 3,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "I live in a nursing home with not good wi-fi. Always get kicked off. This updates to Manual Set up. Frustrating! I can't get Amazon XXX or ORF \u0026 no idea what they mean or where they are! I've had this for a couple years, LOVE her, but the re-set constantly is heartbreaking. Takes forever.",
	"author": "Renee Colbert",
	"review_source": "GooglePlayStore",
	"rating": 4,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "I absolutely love Amazon Alexa. So awesome and everything is in one place!! Also really like how you can add features to your Amazon Echo.",
	"author": "Leah Lee",
	"review_source": "GooglePlayStore",
	"rating": 5,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Its been months and still can't DL the app. Wasted hours on phone w y'all and nothing.  LG XPower w marshmallow",
	"author": "",
	"review_source": "GooglePlayStore",
	"rating": 1,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "This is a app that you can connect your Alexa device it makes you learn things and tell you things it is helpful",
	"author": "dominik wielosik",
	"review_source": "GooglePlayStore",
	"rating": 5,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-25T00:00:00.000Z"
}, {
	"review": "Why did you take away the history of what songs were listened to in the app? It was there yesterday before the app updated. It now says to ask Alexa. I looked back at that when I was not home near Alexa, now I can't do that. Went to show a friend and it says it is not supported, ask Alexa, hard to do when you are not near it.   Newest issue, when I go to music, TuneIn in the app, it shows I'm in a different city and state and Alexa can't find a station I have listened to since I got the Dot.",
	"author": "George Geller",
	"review_source": "GooglePlayStore",
	"rating": 2,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-26T00:00:00.000Z"
}, {
	"review": "Worst app on my phone. Very slow to open, frequently crashes, seems to require me to sign in on a weekly basis at present, really let's down the Amazon ecosystem. The shopping list would be really useful if the Android app worked reliably",
	"author": "Paul French",
	"review_source": "GooglePlayStore",
	"rating": 1,
	"title": "",
	"product_name": "Amazon Alexa",
	"reviewed_date": "2018-02-26T00:00:00.000Z"
}]